Revit 2024 API
ScheduleDefinition.RemoveField Method (ScheduleFieldId)
 Removes a field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void RemoveField(
	ScheduleFieldId fieldId
)
Visual Basic
Public Sub RemoveField ( _
	fieldId As ScheduleFieldId _
)
Visual C++
public:
void RemoveField(
	ScheduleFieldId^ fieldId
)
Parameters
fieldId
Type: Autodesk.Revit.DB.ScheduleFieldId
 The ID of the field to remove.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleDefinition Class
RemoveField Overload
Autodesk.Revit.DB Namespace